{
  "bleeding": {
    "primary_message": "Bleeding gums detected. While this can indicate gingivitis, it may also suggest other health conditions.",
    "immediate_recommendations": "Improve oral hygiene immediately by brushing twice daily with a soft-bristled toothbrush. Floss gently once daily and use antimicrobial mouthwash. Monitor for additional symptoms over the next 7-14 days.",
    "watch_for_additional_symptoms": "Look out for gum swelling, gum redness or color changes, bad breath, gum tenderness or pain, gums pulling away from teeth, or loose teeth.",
    "possible_causes": "Dental causes include poor oral hygiene, smoking, gingivitis, periodontitis, or trench mouth. Other health conditions that can cause bleeding gums include diabetes, hormone changes during puberty, pregnancy or menopause, vitamin K deficiency, vitamin C deficiency or scurvy, blood-thinning medications (anticoagulants), pernicious anemia, thrombocytopenia, hemophilia, Von Willebrand disease, oral herpes, HIV/AIDS, stress, or leukemia.",
    "professional_consultation": "Consult a dentist if bleeding persists after 1-2 weeks of improved oral care, if bleeding is severe or frequent, if you have diabetes or take blood thinners, or if additional symptoms develop.",
    "prevention": "Even though bleeding gums can have various causes, you can prevent progression to gingivitis by maintaining excellent oral hygiene. Brush thoroughly twice a day with fluoride toothpaste, floss daily to remove bacteria between teeth, use antimicrobial mouthwash, manage diabetes if you have it, avoid smoking or tobacco products, limit foods and drinks with alcohol and excess sugar, and see a dentist at least once a year for checkups."
  },
  "swelling": {
    "primary_message": "Gum swelling detected. This could indicate early gum disease or other dental and health issues.",
    "immediate_recommendations": "Check for food particles or objects stuck between teeth and gums. Rinse with warm salt water (half teaspoon salt in 8 ounces warm water). Brush gently with a soft-bristled toothbrush and avoid irritating the swollen area.",
    "watch_for_additional_symptoms": "Monitor for bleeding when brushing or flossing, gum redness, bad breath, tender or painful gums, pus between teeth and gums, or changes in bite or tooth alignment.",
    "possible_causes": "Dental causes include getting something stuck in your gums (like a popcorn hull), abscessed tooth, gingivitis, periodontitis, trench mouth, gingivostomatitis (viral or bacterial infection of your mouth), poorly fitting dentures, orthodontic treatment, tooth decay, infected tooth, root fracture, or unknown objects caught under your gums (like food or dental cement). Other health conditions include medication side effects, viral infections like oral herpes or HIV, fungal infections like thrush, vitamin B deficiency, vitamin C deficiency or scurvy, unmanaged diabetes, smoking or using other tobacco products, hormonal changes during puberty, pregnancy and menopause, or blood cancers like leukemia.",
    "professional_consultation":"See a dentist if swelling persists after removing trapped debris and improving oral hygiene, if swelling is around only one tooth (possible abscess), if you have diabetes or other health conditions, or if pain accompanies the swelling.",
    "prevention": "To prevent swollen gums from developing into gingivitis, maintain thorough oral hygiene by brushing twice daily, flossing every day, using antimicrobial mouthwash, managing diabetes if present, avoiding tobacco products, limiting sugary and alcoholic beverages, and scheduling regular dental checkups at least annually. If you have a family history of gum disease, you may need more frequent cleanings."
  },
  "redness": {
    "primary_message": "Gum redness detected. This early sign of inflammation may indicate gingivitis or other oral health issues.",
    "immediate_recommendations": "Improve oral hygiene by brushing twice daily with fluoride toothpaste and a soft-bristled toothbrush. Use gentle circular motions and avoid aggressive brushing. Floss daily and rinse with antimicrobial mouthwash.",
    "watch_for_additional_symptoms": "Monitor for bleeding during brushing or flossing, gum swelling, bad breath, tender gums, or gums that appear to be pulling away from teeth.",
    "possible_causes": "Red gums can result from plaque buildup, poor oral hygiene, aggressive brushing, hormonal changes during puberty, pregnancy or menopause, certain medications, smoking or tobacco use, vitamin deficiencies (particularly vitamin C and K), autoimmune conditions, allergic reactions to dental products, diabetes, stress, or blood disorders. In some cases, persistent gum redness may indicate underlying systemic health conditions that require medical evaluation.",
    "professional_consultation": "Consult a dentist if redness persists after one week of improved oral hygiene, if redness is accompanied by pain or other symptoms, or if you notice changes in gum texture or appearance.",
    "prevention": "Red gums are often an early warning sign. Prevent progression to full gingivitis by establishing excellent oral hygiene habits now. Brush thoroughly twice daily with fluoride toothpaste, floss daily to remove plaque and bacteria between teeth, rinse with antimicrobial mouthwash, avoid smoking and tobacco products, manage diabetes if you have it, limit sugary and alcoholic foods and drinks, and maintain regular dental visits at least once yearly for professional cleanings and checkups."
  },
  "bleeding_redness": {
    "primary_message": "Bleeding and redness detected.",
    "immediate_recommendations": "Use a soft-bristled toothbrush, avoid harsh brushing.",
    "watch_for_additional_symptoms": "If swelling appears, this could indicate gingivitis.",
    "possible_causes": "Early gum irritation due to plaque.",
    "professional_consultation": "Dental cleaning may be needed soon.",
    "prevention": "Brush gently and floss regularly."
  },
  "redness_swelling": {
    "primary_message": "Redness and swelling detected.",
    "immediate_recommendations": "Rinse with salt water, avoid sugary foods.",
    "watch_for_additional_symptoms": "Bleeding could indicate progression to gingivitis.",
    "possible_causes": "Gum inflammation or mild infection.",
    "professional_consultation": "Consider a check-up if it persists.",
    "prevention": "Improve oral hygiene habits."
  },
  "bleeding_swelling": {
    "primary_message": "Bleeding and swelling detected.",
    "immediate_recommendations": "Maintain soft brushing and avoid irritants.",
    "watch_for_additional_symptoms": "If redness occurs, gingivitis is likely.",
    "possible_causes": "Plaque or early gum disease.",
    "professional_consultation": "Schedule a dental visit if it continues.",
    "prevention": "Use antiseptic rinse, brush and floss properly."
  },
  "gingivitis": {
    "primary_message": "All three symptoms detected: likely gingivitis.",
    "immediate_recommendations": "Use antiseptic mouthwash, brush gently twice daily.",
    "watch_for_additional_symptoms": "Persistent pain, bad breath, gum recession.",
    "possible_causes": "Plaque buildup, poor oral hygiene, smoking.",
    "professional_consultation": "Visit a dentist for professional cleaning and further assessment.",
    "prevention": "Maintain good oral hygiene, regular dental checkups."
  }
}